<template>
  <div class="MainPage">
    <div class="Logo-outer">
      <prj-logo-zhtw v-if="$root.$i18n.locale === 'zh-goyu'" class="Logo" />
      <prj-logo v-else class="Logo" />
    </div>
    <div class="PolicyText-outer">
      <p>
        一般社団法人コード・フォー・ジャパン（以下、「弊団体」といいます）は、弊団体が運営するこのウェブサービス「おうちで時間割」（以下「本サービス」といいます）に関し、以下のとおり利用規約を定めます（以下、「本規約」といいます。）。本規約は、全ての本サイトへの訪問者、登録ユーザーその他本サービスにアクセスする全ての当事者（以下「ユーザー」）に適用されます。
      </p>
      <p>第1条（適用等）</p>

      <ol>
        <li>
          本規約は、本サービスの提供条件及び本サービスの利用に関する弊団体とユーザーとの間の権利義務関係を定めることを目的とし、ユーザー及び弊団体との間の本サービスの利用に関わる一切の関係に適用されます。
        </li>
        <li>
          本規約の内容と、その他の本規約外における本サービスの説明等とが異なる場合は、本規約の規定が優先して適用されるものとします。
        </li>
        <li>
          本サービスでは、HTML5及びJavaScript、CSS3、SVGを使用するものとします。なお、以下の推奨ブラウザをご利用の場合、ブラウザの設定でこれら機能を有効にしておくことで、最善のレイアウトで本サイトを閲覧することができます。
          <ul>
            <li>Windows Google Chrome、Firefox、Opera （各ブラウザ最新版）</li>
            <li>macOS Google Chrome、Safari、Firefox （各ブラウザ最新版）</li>
            <li>iOS（iPhone、iPad） Safari（OSバージョン 12.0以降）</li>
            <li>iPadOS Safari（OSバージョン 13.0以降）</li>
            <li>Android Chrome（OSバージョン 6.0以降）</li>
          </ul>
        </li>
      </ol>
      <br />
      <p>第2条（定義）</p>
      <p>
        本規約において使用する以下の用語は、各々以下に定める意味を有するものとします。
      </p>
      <ol>
        <li>
          「知的財産権」とは、著作権、特許権、実用新案権、意匠権、商標権その他の知的財産権（それらの権利を取得し、またはそれらの権利につき登録等を出願する権利を含みます。）を意味します。
        </li>
        <li>
          「投稿データ」とは、登録ユーザーが本サービスを利用して投稿その他送信するコンテンツ（文章、画像、動画その他のデータを含みますがこれらに限りません。）を意味します。
        </li>
        <li>
          「弊団体」とは、一般社団法人コード・フォー・ジャパンを意味します。
        </li>
        <li>
          「弊団体ウェブサイト」とは、そのドメインが「code4japan.org」もしくは「studyathome.jp」である、弊団体が運営するウェブサイト（理由の如何を問わず、弊団体のウェブサイトのドメインまたは内容が変更された場合は、当該変更後のウェブサイトを含みます。）を意味します。
        </li>
        <li>
          「登録ユーザー」とは、第3条（登録）に基づいて本サービスの利用者としての登録がなされたユーザーを意味します。
        </li>
        <li>
          「本サービス」とは、弊団体が提供する「おうちで時間割」という名称のサービス（理由の如何を問わずサービスの名称または内容が変更された場合は、当該変更後のサービスを含みます。）を意味します。
        </li>
      </ol>
      <br />
      <p>第3条（登録）</p>
      <ol>
        <li>
          登録を希望するユーザー（以下「登録希望者」といいます。）は、本規約及び本サービスのプライバシーポリシーを遵守することに同意し、かつ弊団体の定める一定の情報（以下「登録事項」といいます。）を弊団体の定める方法で弊団体に提供することにより、弊団体に対し、本サービスの利用の登録を申請することができます。
        </li>
        <li>
          弊団体は、弊団体の基準に従って、第１項に基づいて登録申請を行った登録希望者（以下「登録申請者」といいます。）の登録の可否を判断し、弊団体が登録を認める場合にはその旨を登録申請者に通知します。登録申請者の登録ユーザーとしての登録は、弊団体が本項の通知を行ったことをもって完了したものとします。
        </li>
        <li>
          登録ユーザーは、登録時に提供される情報により、教員ユーザー及びその他のユーザーに区分されます。前者は本サービスの全ての機能を利用することができますが、後者は教員ユーザーの投稿データの一部へのアクセスが制限される等の制約が課される場合があります。
        </li>
        <li>
          弊団体は、登録申請者が、以下の各号のいずれかの事由に該当するものと弊団体がその裁量により判断した場合は、登録及び再登録を拒否することがあり、またその理由について一切開示義務を負いません。
          <ul>
            <li>
              弊団体に提供した登録事項の全部または一部につき虚偽、誤記または記載漏れがあった場合
            </li>
            <li>
              弊団体が想定しているサービス利用者である学校教育関係者以外からの登録であることが判明した場合
            </li>
            <li>
              反社会的勢力等（暴力団、暴力団員、暴力団員でなくなった時から5年を経過しない者、暴力団準構成員、暴力団関係企業、総会屋等、社会運動等標ぼうゴロまたは特殊知能暴力集団等、その他これに準ずる者を意味します。以下同じ。）である、または資金提供その他を通じて反社会的勢力等の維持、運営もしくは経営に協力もしくは関与する等反社会的勢力等との何らかの交流もしくは関与を行っているもしくはそのおそれがある場合
            </li>
            <li>第9条に定める措置を受けたことがある場合</li>
            <li>その他、弊団体が登録を適当でないと判断した場合</li>
          </ul>
        </li>
        <li>
          ユーザーが法人その他の事業体を代表または代理して本サービスの利用の登録を申請する場合、本規約におけるユーザー、ならびに本条における登録希望者および登録申請者とは、その事業体を指すものとし、ユーザーがその事業体を代表または代理して、その事業体をサービス利用契約に拘束させる権限を付与されているものであること、およびユーザーがその事業体を代表または代理して本規約およびプライバシーポリシーに合意するものであることをここに表明のうえ保証するものとします。
        </li>
      </ol>
      <br />
      <p>第4条（登録事項の変更）</p>
      <p>
        登録ユーザーは、登録事項に変更があった場合、弊団体の定める方法により当該変更事項を遅滞なく弊団体に通知するものとします。
      </p>
      <br />
      <p>第5条（メールアドレス及びパスワードの管理）</p>
      <ol>
        <li>
          登録ユーザーは、自己の責任において、本サービスに関するメールアドレス及びパスワードを適切に管理及び保管するものとし、これを第三者に利用させ、または貸与、譲渡、名義変更、売買等をしてはならないものとします。
        </li>
        <li>
          メールアドレスまたはパスワードの管理不十分、使用上の過誤、第三者の使用等によって生じた損害に関する責任は登録ユーザーが負うものとし、弊団体は一切の責任を負いません。
        </li>
      </ol>
      <br />
      <p>第6条（禁止事項）</p>
      <p>
        ユーザーは、本サービスの利用にあたり、以下の各号のいずれかに該当する行為または該当すると弊団体が判断する行為をしてはなりません。
      </p>
      <ol>
        <li>法令に違反する行為または犯罪行為に関連する行為</li>
        <li>
          弊団体、他のユーザーまたはその他の第三者に対する詐欺または脅迫行為
        </li>
        <li>公序良俗に反する行為</li>
        <li>
          弊団体、他のユーザーまたはその他の第三者の知的財産権、肖像権、プライバシーの権利、名誉、その他の権利または利益を侵害する行為
        </li>
        <li>
          本サービスを通じ、以下に該当し、または該当すると弊団体が判断する情報を弊団体または他のユーザーに送信すること
          <ul>
            <li>過度に暴力的または残虐な表現を含む情報</li>
            <li>
              コンピューター・ウィルスその他の有害なコンピューター・プログラムを含む情報
            </li>
            <li>
              弊団体、他のユーザーまたはその他の第三者の名誉または信用を毀損する表現を含む情報
            </li>
            <li>過度にわいせつな表現を含む情報</li>
            <li>差別を助長する表現を含む情報</li>
            <li>自殺、自傷行為を助長する表現を含む情報</li>
            <li>薬物の不適切な利用を助長する表現を含む情報</li>
            <li>反社会的な表現を含む情報</li>
            <li>チェーンメール等の第三者への情報の拡散を求める情報</li>
            <li>他人に不快感を与える表現を含む情報</li>
            <li>面識のない異性との出会いを目的とした情報</li>
          </ul>
        </li>
        <li>
          本サービスのネットワークまたはシステム等に過度な負荷をかける行為
        </li>
        <li>本サービスの運営を妨害するおそれのある行為</li>
        <li>
          弊団体のネットワークまたはシステム等に不正にアクセスし、または不正なアクセスを試みる行為
        </li>
        <li>第三者に成りすます行為</li>
        <li>他の登録ユーザーのメールアドレスまたはパスワードを利用する行為</li>
        <li>
          弊団体が事前に許諾しない本サービス上での宣伝、広告、勧誘、または営業行為
        </li>
        <li>他のユーザーの情報の収集</li>
        <li>
          弊団体、本サービスの他の利用者またはその他の第三者に不利益、損害、不快感を与える行為
        </li>
        <li>反社会的勢力等への利益供与</li>
        <li>前各号の行為を直接または間接に惹起し、または容易にする行為</li>
        <li>その他、弊団体が不適切と判断する行為</li>
      </ol>
      <br />
      <p>第7条（本サービスの停止等）</p>
      <ol>
        <li>
          弊団体は、以下のいずれかに該当する場合には、事前に通知することなく、本サービスの全部または一部の提供を停止または中断することができるものとします。
          <ol>
            <li>
              本サービスに係るコンピューター・システムの点検または保守作業を緊急に行う場合
            </li>
            <li>コンピューター、通信回線等が事故により停止した場合</li>
            <li>
              地震、落雷、火災、風水害、停電、天災地変、疫病などの不可抗力により本サービスの運営ができなくなった場合
            </li>
            <li>その他、弊団体が停止または中断を必要と判断した場合</li>
          </ol>
        </li>
        <li>
          弊団体は、本条に基づき弊団体が行った措置に基づきユーザーに生じた損害について一切の責任を負いません。
        </li>
      </ol>
      <br />
      <p>第8条（権利帰属）</p>
      <ol>
        <li>
          弊団体ウェブサイト及び本サービスに関する知的財産権は全て弊団体または弊団体にライセンスを許諾している者に帰属しており、本規約に基づく本サービスの利用許諾は、弊団体ウェブサイトまたは本サービスに関する弊団体または弊団体にライセンスを許諾している者の知的財産権の使用許諾を意味するものではありません。
        </li>
        <li>
          ユーザーは、投稿データについて、自らが投稿その他送信することについての適法な権利を有していること、及び投稿データが第三者の権利を侵害していないことについて、弊団体に対し表明し、保証するものとします。
        </li>
        <li>
          ユーザーは、本サービスを利用して投稿その他送信するコンテンツ（文章、画像、動画その他のデータを含むがこれに限らない）について、弊団体に対し、世界的、非独占的、無償な使用、複製、配布、派生著作物の作成、表示及び実行に関するライセンスを付与します。
        </li>
        <li>
          登録ユーザーは、弊団体及び弊団体から権利を承継しまたは許諾された者に対して著作者人格権を行使しないことに同意するものとします。
        </li>
      </ol>
      <br />
      <p>第9条（登録抹消等）</p>
      <ol>
        <li>
          弊団体は、以下の各号のいずれかの事由に該当する場合は、事前に通知または催告することなく、投稿データを削除しもしくは当該投稿データを掲載した登録ユーザーについて本サービスの利用を一時的に停止し、または登録ユーザーとしての登録を抹消することができます。
          <ol>
            <li>本規約のいずれかの条項に違反した場合</li>
            <li>登録事項に虚偽または不正確な事実があることが判明した場合</li>
            <li>第3条第5項各号のいずれかに該当することが判明した場合</li>
            <li>
              その他、弊団体が本サービスの利用、登録ユーザーとしての登録の継続を適当でないと判断した場合
            </li>
          </ol>
        </li>
        <li>
          弊団体は、本条に基づき弊団体が行った行為により登録ユーザーに生じた損害について一切の責任を負いません。
        </li>
        <li>
          登録ユーザーは、弊団体所定の方法で弊団体に通知することにより、自己の登録ユーザーとしての登録を抹消することができます。
        </li>
      </ol>
      <br />
      <p>第11条（本サービスの内容の変更、終了）</p>
      <ol>
        <li>
          弊団体は、弊団体の都合により、本サービスの内容を変更し、または提供を終了することができます。弊団体が本サービスの提供を終了する場合、弊団体は登録ユーザーに事前に通知するものとします。
        </li>
        <li>
          弊団体は、本条に基づき弊団体が行った措置に基づきユーザーに生じた損害について一切の責任を負いません。
        </li>
      </ol>
      <br />
      <p>第12条（保証の否認及び免責）</p>
      <ol>
        <li>
          弊団体は、本サービスがユーザーの特定の目的に適合すること、期待する機能・商品的価値・正確性・有用性を有すること、ユーザーによる本サービスの利用がユーザーに適用のある法令または業界団体の内部規則等に適合すること、及び不具合が生じないことについて、何ら保証するものではありません。
        </li>
        <li>
          弊団体は、弊団体による本サービスの提供の中断、停止、終了、利用不能または変更、ユーザーが本サービスに送信したメッセージまたは情報の削除または消失、登録ユーザーの登録の抹消、本サービスの利用による登録データの消失または機器の故障もしくは損傷、その他本サービスに関してユーザーが被った損害（以下「ユーザー損害」といいます。）につき、賠償する責任を一切負わないものとします。
        </li>
        <li>
          本サービスまたは弊団体ウェブサイトに関連してユーザーと他のユーザーまたは第三者との間において生じた取引、連絡、紛争等については、弊団体は一切責任を負いません。
        </li>
      </ol>
      <br />
      <p>第13条（秘密保持）</p>
      <p>
        登録ユーザーは、本サービスに関連して弊団体が登録ユーザーに対して秘密に取り扱うことを求めて開示した非公知の情報について、弊団体の事前の書面による承諾がある場合を除き、秘密に取り扱うものとします。
      </p>
      <br />
      <p>第14条（利用者情報の取扱い）</p>
      <ol>
        <li>
          弊団体によるユーザーの利用者情報の取扱いについては、弊団体のプライバシーポリシー（<a
            href="https://www.code4japan.org/privacy-policy"
            rel="noopener"
            target="_blank"
            >https://www.code4japan.org/privacy-policy</a
          >）の定めによるものとし、ユーザーはこのプライバシーポリシーに従って弊団体がユーザーの利用者情報を取扱うことについて同意するものとします。
        </li>
        <li>
          弊団体は、本サービスに関連して弊団体がユーザーから取得した情報、データ等を、個人を特定できない形での統計的な情報として、弊団体の裁量で、利用及び公開することができるものとし、登録ユーザーはこれに異議を唱えないものとします。
        </li>
      </ol>
      <br />
      <p>第15条（本規約等の変更）</p>
      <p>
        弊団体は、本規約を任意に改定できるものとし、また弊団体において本規約を補充する規約（以下「補充規約」といいます）を定めることができます。本規約の改定または補充は、改定後の本規定もしくは補充規約を弊団体の所定のサイトに掲示した時また弊団体が指定した日時にその効力を生じるものとします。この場合、ユーザーは、改定後の規約および補充規約に従うものとします。
      </p>
      <br />
      <p>第16条（連絡／通知）</p>
      <p>
        本サービスに関する問い合わせその他ユーザーから弊団体に対する連絡または通知、及び本規約の変更に関する通知その他弊団体からユーザーに対する連絡または通知は、弊団体の定める方法で行うものとします。
      </p>
      <br />
      <p>第17条（サービスにかかる事業の譲渡等）</p>
      <p>
        弊団体は本サービスにかかる事業を他社に譲渡した場合には、当該事業譲渡に伴い本規約に基づく権利及び義務並びに登録ユーザーの登録事項その他の顧客情報を当該事業譲渡の譲受人に譲渡することができるものとし、登録ユーザーは、かかる譲渡につき本項において予め同意するものとします。なお、本項に定める事業譲渡には、通常の事業譲渡のみならず、会社分割その他事業が移転するあらゆる場合を含むものとします。
      </p>
      <br />
      <p>第18条（分離可能性）</p>
      <p>
        本規約のいずれかの条項またはその一部が、法令等により無効または執行不能と判断された場合であっても、本規約の残りの規定及び一部が無効または執行不能と判断された規定の残りの部分は、継続して完全に効力を有するものとします。
      </p>
      <br />
      <p>第19条（準拠法及び管轄裁判所）</p>
      <ol>
        <li>本規約の準拠法は日本法とします。</li>
        <li>
          本規約に起因し、または関連する一切の紛争については、東京簡易裁判所又は東京地方裁判所を第一審及び調停の専属的合意管轄裁判所とします。
        </li>
      </ol>
      <br />
      <p>本規約は、2020年6月16日より施行するものとします。</p>
      <p style="text-align: right">以上</p>
    </div>
    <label class="Checkbox-label">
      利用規約に同意します
      <input
        v-model="toggle"
        type="checkbox"
        value="check"
        class="Checkbox-original"
      />
      <v-icon v-if="isCheck" color="#0071C2">mdi-check-box-outline</v-icon>
      <v-icon v-else color="#0071C2">mdi-checkbox-blank-outline</v-icon>
    </label>
    <base-action-button
      :is-disabled="!isCheck"
      class="Button"
      theme="primary"
      text="登録へ進む"
      @click="$router.push('/user/signup')"
    />
    <base-action-button
      class="Button"
      theme="border"
      text="同意しない"
      @click="$router.push('/')"
    />
  </div>
</template>

<script lang="ts">
import Vue from 'vue'
import PrjLogo from '@/assets/svgs/prj_logo.svg'
import PrjLogoZhtw from '@/assets/svgs/prj_logo-zhtw.svg'
import BaseActionButton from '@/components/BaseActionButton.vue'

export default Vue.extend({
  components: { PrjLogo, PrjLogoZhtw, BaseActionButton },
  layout: 'simple',
  data() {
    return {
      toggle: [],
    }
  },
  computed: {
    isCheck(): boolean {
      return Boolean(this.toggle.length)
    },
  },
})
</script>

<style lang="scss" scoped>
.MainPage {
  background-color: $color-white;
  border-radius: 14px;
  padding: 16px;
}
.Logo-outer {
  display: flex;
  justify-content: center;
}
.Logo {
  width: 115px;
}
.PolicyText-outer {
  background-color: $color-back-gray;
  border-radius: 14px;
  padding: 16px;
}
.Checkbox-label {
  display: flex;
  justify-content: center;
  margin: 24px 0;
}
.Checkbox-original {
  display: none;
}
.Button {
  margin-bottom: 16px;
}
</style>
